tutorials/verification/innerSpherePartTransp/baseCase_flow/system/controlDict
<<<<<<< HEAD:tutorials/verification/innerSpherePartTransp/baseCase_dynamic/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//application     reactingHetCatSimpleFoam;
application     customSolver;

startFrom       startTime;

startTime 	    0;

stopAt          endTime;

endTime	        100;

deltaT          1;

writeControl    timeStep;

writeInterval 	50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //

functions
{
      #include "residuals"
}
=======
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//application     reactingHetCatSimpleFoam;
application     customSolver;

startFrom       startTime;

startTime 	    0;

stopAt          endTime;

endTime	        1000;

deltaT          1;

writeControl    timeStep;

writeInterval 	5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //

functions
{
      #include "residuals"
}
>>>>>>> 00108f551382890234d2b5989ffac74602e16a99:tutorials/verification/innerSpherePartTransp/baseCase_flow/system/controlDict
