tutorials/verification/innerSpherePartTransp/baseCase_flow/0.org/p
<<<<<<< HEAD:tutorials/verification/innerSpherePartTransp/baseCase_dynamic/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type    totalPressure;
        p0      uniform 101325;
        value   uniform 101325;
    
        U       U;
        phi     phi;
    }
    outlet
    {
        type    zeroGradient;
    }
    sides
    {
        type    zeroGradient;
    }
    sphere
    {
        type    totalPressure;
        p0      uniform 101325;
        value   uniform 101325;
    
        U       U;
        phi     phi;
    }
}

// ************************************************************************* //
=======
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type    totalPressure;
        p0      uniform 101325;
        value   uniform 101325;
    
        U       U;
        phi     phi;
    }
    outlet
    {
        type    zeroGradient;
    }
    sides
    {
        type    symmetry;
    }
    sphere
    {
        type    totalPressure;
        p0      uniform 101325;
        value   uniform 101325;
    
        U       U;
        phi     phi;
    }
}

// ************************************************************************* //
>>>>>>> 00108f551382890234d2b5989ffac74602e16a99:tutorials/verification/innerSpherePartTransp/baseCase_flow/0.org/p
